package org.example.dto;

import lombok.*;

@AllArgsConstructor
@Getter
@Setter
@ToString
@NoArgsConstructor
/*
правя още един пакет, в който да включа други модели, които използват ентити моделите и комбинират свойствата им гъвкаво, без да ги променят.  Последното е важно, защото те са част от persistence layer и са свързани с таблиците. Трябва да работя с DTO модели - data transfer objects. това е overengineering. искам да бъда на абстрактното ниво, на което е сървисът. понеже служителят ми има повече свойства, отколкото компанията, ще го ползвам за отправна точка. ще направя този employee DTO модел, който няма да бъде ентити и свързано директно с таблица, а ще бъде само за да изпълнявам заявките като резултат. DAO layer-a вече трябва да работи с dto обектите. DTO трябва да има конструктор, който да позволява да бъдат записани свойствата и да бъде направена връзката между ентити модела и DTO модела. DTO моделът е за да получавам резултати от заявки, за да ъпдейтвам свойства и да създавам нови записи в таблици, когато имплементирам DAO layer.
 */
public class EmployeeDto {
    private long id;
    private String name;
    private int age;
    private long companyId;
}
